export const one: string[] = [
  "-Проверка рулевого управления",
  "-Обнаружение мех.неисправностей",
  "-Выявление причин неисправностей",
  "-Консультация специалиста",
];
export const two: string[] = [
  "-Полная разборка рулевой рейки",
  "-Полировка,шлифовка штока",
  "-Замена сальников",
  "-Устранение люфта и стука",
  "-Регулировка рейки",
];
export const three: string[] = [
  "-Проверку рулевой рейки на стенде",
  "-Проверка работы систем ГУР",
  "-Тест на отсутствие люфтов",
  "-Проверка всех соединений",
  "-Диагностика всей подвески",
];
export const four: string[] = [
  `Наши мастера всегда готовы показать
все неисправности и рассказать о них
на понятном Вам языке`,
];
